{
    "All links on the page should redirect to an url using HTTPS instead of HTTP because this is more secure.": "يجب أن تعيد جميع الروابط في الصفحة التوجيه إلى عنوان URL باستخدام HTTPS بدلاً من HTTP لأن هذا أكثر أمانًا.",
    "CSS files are not bigger than 15 KB because this will slow down the page load time.": "لا يجب أن تكون ملفات CSS أكبر من 15 كيلوبايت لأن هذا سيبطئ من وقت تحميل الصفحة.",
    "Every image on the page should have an alt tag to describe the image.": "يجب أن تحتوي كل صورة على الصفحة على علامة alt لوصف الصورة.",
    "HTML is not larger than 100 KB because this will slow down the page load time.": "لا يجب أن يكون HTML أكبر من 100 كيلوبايت لأن هذا سيبطئ من وقت تحميل الصفحة.",
    "Images are not larger than 1 MB because this will slow down the page load time.": "لا يجب أن تكون الصور أكبر من 1 ميغابايت لأن هذا سيبطئ من وقت تحميل الصفحة.",
    "Javascript files are not bigger than 1 MB because this will slow down the page load time.": "لا يجب أن تكون ملفات Javascript أكبر من 1 ميغابايت لأن هذا سيبطئ من وقت تحميل الصفحة.",
    "The HTML of the page should be GZIP compressed to reduce the size of the response.": "يجب أن يكون HTML للصفحة مضغوطًا بتنسيق GZIP لتقليل حجم الاستجابة.",
    "The Time To First Byte (TTFB) should be below 600 ms because this will improve the page load time.": "يجب أن يكون الوقت للبايت الأول (TTFB) أقل من 600 ميلي ثانية لأن هذا سيحسن من وقت تحميل الصفحة.",
    "The content should contain at least 30% transition words.": "يجب أن يحتوي المحتوى على الأقل 30% من كلمات الانتقال.",
    "The content should not contain sentences with more than 20 words.": "لا يجب أن يحتوي المحتوى على جمل تحتوي على أكثر من 20 كلمة.",
    "The focus keyword should be in the first paragraph of the content because this is the most important part of the content.": "يجب أن تكون الكلمة الرئيسية في الفقرة الأولى من المحتوى لأن هذا هو الجزء الأكثر أهمية من المحتوى.",
    "The focus keyword should be in the title of the page because the visitor will see this in the search results.": "يجب أن تكون الكلمة الرئيسية في عنوان الصفحة لأن الزائر سيرى هذا في نتائج البحث.",
    "The lang attribute should be set because this is used by search engines to determine the language of the page.": "يجب تعيين خاصية اللغة لأن محركات البحث تستخدمها لتحديد لغة الصفحة.",
    "The length of the content should be at least 2100 characters.": "يجب أن يكون طول المحتوى على الأقل 2100 حرف.",
    "The meta description is used by search engines to show a description of the page in the search results.": "تستخدم وصف الصفحة من قبل محركات البحث لعرض وصف الصفحة في نتائج البحث.",
    "The page response should return a 200 status code because this means the page is available.": "يجب أن تعود استجابة الصفحة برمز الحالة 200 لأن هذا يعني أن الصفحة متاحة.",
    "The page should have an Open Graph image because this is the image that will be used when the page is shared on social media.": "يجب أن تحتوي الصفحة على صورة Open Graph لأن هذه هي الصورة التي ستستخدم عند مشاركة الصفحة على وسائل التواصل الاجتماعي.",
    "The page should have only one H1 tag because there should be only one main heading on the page. The H1 tag should be used to describe the main topic of the page. The H1 tag is also used by search engines to determine the topic of the page.": "يجب أن تحتوي الصفحة على علامة H1 واحدة فقط لأنه يجب أن يكون هناك عنوان رئيسي واحد فقط على الصفحة. يجب استخدام علامة H1 لوصف الموضوع الرئيسي للصفحة. تستخدم علامة H1 أيضًا من قبل محركات البحث لتحديد موضوع الصفحة.",
    "The page should not contain any broken images because it is bad for the user experience.": "لا يجب أن تحتوي الصفحة على أي صور معطلة لأن هذا سيء لتجربة المستخدم.",
    "The page should not contain any broken links because it is bad for the user experience.": "لا يجب أن تحتوي الصفحة على أي روابط معطلة لأن هذا سيء لتجربة المستخدم.",
    "The robots.txt file should allow indexing of the page.": "يجب أن يسمح ملف robots.txt بفهرسة الصفحة.",
    "The title of the page should not be longer than 60 characters because this is the maximum length that is shown in the search results.": "لا يجب أن يكون عنوان الصفحة أطول من 60 حرفًا لأن هذا هو الطول الأقصى الذي يظهر في نتائج البحث.",
    "When the page has the 'nofollow' tag or meta tag set, search engines will not follow the links on the page.": "عندما تحتوي الصفحة على علامة 'nofollow' أو مجموعة علامات meta، فإن محركات البحث لن تتبع الروابط على الصفحة.",
    "When the page has the 'noindex' tag or meta tag set, search engines will not index the page.": "عندما تحتوي الصفحة على علامة 'noindex' أو مجموعة علامات meta، فإن محركات البحث لن تفهرس الصفحة.",
    "accordingly": "وفقًا لذلك",
    "additionally": "بالإضافة إلى ذلك",
    "admittedly": "يُعترف",
    "after": "بعد",
    "afterward": "بعد ذلك",
    "all in all": "في الجملة",
    "although": "على الرغم من",
    "an example of this is": "مثال على ذلك هو",
    "as a result": "نتيجة لذلك",
    "as well as": "فضلا عن",
    "because": "لأن",
    "before": "قبل",
    "besides": "إلى جانب",
    "but also": "ولكن أيضا",
    "certainly": "بالتأكيد",
    "compared to": "مقارنة بـ",
    "consequently": "بناءً عليه",
    "conversely": "على العكس",
    "due to": "بسبب",
    "during": "خلال",
    "even though": "حتى وإن",
    "eventually": "في النهاية",
    "failed.configuration.nofollow.meta": "تحتوي الصفحة على وسم ميتا nofollow، بينما يجب ألا تحتوي.",
    "failed.configuration.nofollow.tag": "تحتوي الصفحة على وسم nofollow، بينما يجب ألا تحتوي.",
    "failed.configuration.noindex.meta": "تحتوي الصفحة على وسم ميتا noindex، بينما يجب ألا تحتوي.",
    "failed.configuration.noindex.tag": "تحتوي الصفحة على وسم noindex، بينما يجب ألا تحتوي.",
    "failed.configuration.robots.disallowed": "يحتوي ملف robots.txt لهذه الصفحة على قاعدة disallow لهذه الصفحة.",
    "failed.configuration.robots.missing_url": "لم نتمكن من الحصول على ملف robots.txt لهذه الصفحة.",
    "failed.content.alt_tag": "تحتوي الصفحة على صور بدون وسوم alt أو بوسوم alt فارغة. تم العثور على هذه الصور: :actualValue.",
    "failed.content.broken_images": "تحتوي الصفحة على صور معطوبة. تم العثور على هذه الصور: :actualValue.",
    "failed.content.broken_links": "تحتوي الصفحة على روابط معطوبة. تم العثور على هذه الروابط: :actualValue.",
    "failed.content.length": "طول المحتوى هو :actualValue حروف. يجب أن يكون على الأقل :expectedValue حروف.",
    "failed.content.length.parse": "لم نتمكن من تحليل محتوى هذه الصفحة، يرجى المحاولة مرة أخرى.",
    "failed.content.mixed_content": "تحتوي الصفحة على روابط لعناوين غير آمنة، بينما يجب ألا تحتوي. تم العثور على هذه الروابط: :actualValue.",
    "failed.content.multiple_h1": "تحتوي الصفحة على عدة وسوم h1، بينما يجب ألا تحتوي. تم العثور على هذه الوسوم: :actualValue.",
    "failed.content.no_heading": "لا تحتوي الصفحة على أي وسم h1، بينما يجب أن تحتوي.",
    "failed.content.no_title": "لا تحتوي الصفحة على وسم عنوان، بينما يجب أن تحتوي.",
    "failed.content.title_length": "طول عنوان الصفحة هو :actualValue حروف. يجب ألا يتجاوز :expectedValue حروف.",
    "failed.content.too_long_sentence": "تحتوي الصفحة على :actualValue جمل طويلة جدًا تتجاوز 20% من إجمالي الجمل. يجب تصحيح :neededToFix جمل لتلبية الحد الأقصى 20%.",
    "failed.content.transition_words_ratio_check.no_phrases_found": "لا تحتوي الصفحة على أي كلمات انتقالية.",
    "failed.content.transition_words_ratio_check.too_few_transition_words": "تحتوي الصفحة على عدد قليل جدًا من الكلمات الانتقالية. الحد الأدنى الموصى به هو 30%، بينما العدد الفعلي هو :actualValue%.",
    "failed.meta.description": "لا تحتوي الصفحة على وسم وصف ميتا، بينما يجب أن تحتوي.",
    "failed.meta.keyword_in_first_paragraph_check": "لا تحتوي الصفحة على الكلمة الرئيسية في الفقرة الأولى، بينما يجب أن تحتوي.",
    "failed.meta.keyword_in_title_check": "لا يحتوي عنوان الصفحة على الكلمة الرئيسية، بينما يجب أن يحتوي.",
    "failed.meta.no_lang": "لا تحتوي الصفحة على سمة اللغة، بينما يجب أن تحتوي.",
    "failed.meta.open_graph_image": "لا تحتوي الصفحة على صورة الرسم البياني المفتوح، بينما يجب أن تحتوي.",
    "failed.meta.open_graph_image.broken": "تحتوي الصفحة على صورة الرسم البياني المفتوح المعطوبة. تم العثور على هذه الصورة: :actualValue.",
    "failed.meta.title": "يحتوي عنوان الصفحة على :actualValue في العنوان، بينما يجب ألا يحتوي.",
    "failed.meta.title.no_content": "عنوان الصفحة فارغ، بينما يجب ألا يكون كذلك.",
    "failed.performance.compression": "الصفحة غير مضغوطة (باستخدام gzip أو deflate)، بينما يجب أن تكون.",
    "failed.performance.css_size": "تحتوي الصفحة على ملفات CSS كبيرة جدًا (الحد الأقصى :expectedValue). تم العثور على هذه الملفات: :actualValue.",
    "failed.performance.html_size": "تحتوي الصفحة على HTML كبير جدًا (الحد الأقصى :expectedValue)، الحجم الفعلي هو :actualValue.",
    "failed.performance.image_size": "تحتوي الصفحة على صور كبيرة جدًا (الحد الأقصى :expectedValue). تم العثور على هذه الصور: :actualValue.",
    "failed.performance.javascript_size": "تحتوي الصفحة على ملفات Javascript كبيرة جدًا (الحد الأقصى :expectedValue). تم العثور على هذه الملفات: :actualValue.",
    "failed.performance.response": "أعادت الصفحة رمز استجابة غير :expectedValue. كان رمز الاستجابة الفعلي هو :actualValue.",
    "failed.performance.ttfb": "استغرقت الصفحة وقتًا طويلًا للتحميل (الحد الأقصى :expectedValuems). الوقت الفعلي كان :actualValuems.",
    "failed.performance.ttfb.missing_url": "لم نتمكن من الحصول على TTFB لهذه الصفحة.",
    "finally": "أخيرًا",
    "first": "أولاً",
    "for example": "على سبيل المثال",
    "for instance": "على سبيل المثال",
    "furthermore": "علاوة على ذلك",
    "granted": "مُمنوح",
    "however": "ومع ذلك",
    "in addition": "بالإضافة إلى ذلك",
    "in comparison": "بالمقارنة",
    "in conclusion": "في الختام",
    "in contrast": "في المقابل",
    "in other words": "بعبارة أخرى",
    "in particular": "على وجه الخصوص",
    "in summary": "باختصار",
    "in the future": "في المستقبل",
    "in the meantime": "في الوقت الحالي",
    "in the past": "في الماضي",
    "in this case": "في هذه الحالة",
    "indeed": "فعلاً",
    "just as": "تمامًا كما",
    "likewise": "كذلك",
    "meanwhile": "في غضون ذلك",
    "moreover": "علاوة على ذلك",
    "naturally": "بطبيعة الحال",
    "nevertheless": "مع ذلك",
    "next": "التالي",
    "nonetheless": "مع ذلك",
    "not only": "ليس فقط",
    "of course": "بالطبع",
    "on the other hand": "من ناحية أخرى",
    "overall": "في المجمل",
    "owing to": "بسبب",
    "second": "ثانياً",
    "similarly": "بالمثل",
    "similarly to": "مشابه لـ",
    "since": "منذ",
    "so": "لذلك",
    "soon": "قريباً",
    "specifically": "على وجه التحديد",
    "subsequently": "لاحقًا",
    "such as": "مثل",
    "that is to say": "يعني ذلك",
    "then": "ثم",
    "therefore": "لذلك",
    "third": "ثالثاً",
    "thus": "وبالتالي",
    "to clarify": "لتوضيح",
    "to demonstrate": "لإظهار",
    "to illustrate": "لتوضيح",
    "to sum up": "لخص",
    "ultimately": "في النهاية",
    "undoubtedly": "بلا شك",
    "until": "حتى",
    "what's more": "هناك أكثر من ذلك",
    "while": "بينما",
    "while it is true": "بينما هو صحيح",
    "without a doubt": "بلا شك",
    "yet": "بعد"
}
 